Configuration/DataProcessors/бит_ум_МастерНастройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_ум_МастерНастройки</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Configuration/Enums/бит_ум_СтатусыИР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ум_СтатусыИР</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВременноПребывающий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВременноПроживающий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПостоянноПроживающий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Configuration/Catalogs/бит_ум_ВидыДокументовИР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_ум_ВидыДокументовИР</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Обязательный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазваниеДопПоля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазваниеДопПоля2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокНапоминания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДопПоле</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДопПоле2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВидыИР</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатусИР</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ум_СтатусыИР</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РежимВъездаИР</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ум_РежимыВъездаИР</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Configuration/Catalogs/бит_ум_ДействияПоСобытиям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_ум_ДействияПоСобытиям</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КонтролироватьИсполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокИсполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролирующийОрган</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ум_ГосударственныеОрганы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОформляемогоДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ум_ВидыОформляемыхДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеРазбиватьНаСтраницы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьНомерСтраницы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВидыИР</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатусИР</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ум_СтатусыИР</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РежимВъездаИР</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ум_РежимыВъездаИР</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>События</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Событие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ум_ВидыСобытийПоИР</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеНастройки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Настройка</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ум_НастройкиДействий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ум_НастройкиДействий</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Configuration/DataProcessors/бит_ум_МастерНастройки/Forms/НачалоРаботы/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ бит_ум_УчетМигрантовПовтИсп.ЭтоУМ() Тогда
		Заголовок = Заголовок + " БИТ.Учет мигрантов";
	КонецЕсли;
	
	ОткрытаВручную = Параметры.Свойство("ОткрытаВручную") И Параметры.ОткрытаВручную = Истина;

	СтатусыИностранцев.Добавить("Беженец");
	СтатусыИностранцев.Добавить("ВременноПребывающийБезвизовый");
	СтатусыИностранцев.Добавить("ВременноПребывающийВизовый");
	СтатусыИностранцев.Добавить("ВременноПроживающий");
	СтатусыИностранцев.Добавить("ГражданеИзСтранЧленовЕАЭС");
	СтатусыИностранцев.Добавить("ПостоянноПроживающий");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Устанавливаем текущую таблицу переходов.
	ТаблицаПереходовПоСценарию1();
	
	// Позиционируемся на первом шаге помощника.
	УстановитьПорядковыйНомерПерехода(1);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("ПриЗакрытииПомощника", ЭтотОбъект);
	
	ТекстПредупреждения = НСтр("ru = 'Закрыть помощник?'");
	ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияПроизвольнойФормы(
		ЭтотОбъект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, "ЗакрытьФормуБезусловно", Оповещение);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВидыДокументовИР

&НаКлиенте
Процедура ВидыДокументовИРСрокНапоминанияПриИзменении(Элемент)

	Элементы.ВидыДокументовИР.ТекущиеДанные.Отметка = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаДалее(Команда)
	
	ИзменитьПорядковыйНомерПерехода(+1);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаНазад(Команда)
	
	ИзменитьПорядковыйНомерПерехода(-1);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаГотово(Команда)
	
	ЗавершитьНастройкуНаСервере();
	Если ОткрытаВручную Тогда
		ЗакрытьФормуБезусловно = Истина;
		Закрыть();
	Иначе
		ОбновитьИнтерфейс();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	
	Если ОткрытаВручную Тогда
		Закрыть();		
	Иначе
		Оповещение = Новый ОписаниеОповещения("ПриЗакрытииПомощника", ЭтотОбъект);
		ТекстПредупреждения = НСтр("ru = 'Закрыть помощник?'");
		ПоказатьВопрос(Оповещение, ТекстПредупреждения, РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)

	Для Каждого Строка Из ВидыДокументовИР Цикл
		Строка.Отметка = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметки(Команда)

	Для Каждого Строка Из ВидыДокументовИР Цикл
		Строка.Отметка = Ложь;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ИзменитьПорядковыйНомерПерехода(Итератор)
	
	ОчиститьСообщения();
	
	УстановитьПорядковыйНомерПерехода(ПорядковыйНомерПерехода + Итератор);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПорядковыйНомерПерехода(Знач Значение)
	
	ЭтоПереходДалее = (Значение > ПорядковыйНомерПерехода);
	
	ПорядковыйНомерПерехода = Значение;
	
	Если ПорядковыйНомерПерехода < 0 Тогда
		
		ПорядковыйНомерПерехода = 0;
		
	КонецЕсли;
	
	ПорядковыйНомерПереходаПриИзменении(ЭтоПереходДалее);
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядковыйНомерПереходаПриИзменении(Знач ЭтоПереходДалее)
	
	// Выполняем обработчики событий перехода.
	ВыполнитьОбработчикиСобытийПерехода(ЭтоПереходДалее);
	
	// Устанавливаем отображение страниц.
	СтрокиПереходаТекущие = ТаблицаПереходов.НайтиСтроки(Новый Структура("ПорядковыйНомерПерехода", ПорядковыйНомерПерехода));
	
	Если СтрокиПереходаТекущие.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Не определена страница для отображения.'");
	КонецЕсли;
	
	СтрокаПереходаТекущая = СтрокиПереходаТекущие[0];
	
	Элементы.ПанельНавигации.ТекущаяСтраница = Элементы[СтрокаПереходаТекущая.ИмяСтраницыНавигации];
	
	Для Каждого Переход Из ТаблицаПереходов Цикл
		Элементы[Переход.ИмяОсновнойСтраницы].Видимость = Ложь;
	КонецЦикла;
	
	Элементы[СтрокаПереходаТекущая.ИмяОсновнойСтраницы].Видимость = Истина;
	
	// Устанавливаем текущую кнопку по умолчанию.
	КнопкаДалее = ПолучитьКнопкуФормыПоИмениКоманды(Элементы.ПанельНавигации.ТекущаяСтраница, "КомандаДалее");
	
	Если КнопкаДалее <> Неопределено Тогда
		
		КнопкаДалее.КнопкаПоУмолчанию = Истина;
		
	Иначе
		
		КнопкаГотово = ПолучитьКнопкуФормыПоИмениКоманды(Элементы.ПанельНавигации.ТекущаяСтраница, "КомандаГотово");
		
		Если КнопкаГотово <> Неопределено Тогда
			
			КнопкаГотово.КнопкаПоУмолчанию = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЭтоПереходДалее И СтрокаПереходаТекущая.ДлительнаяОперация Тогда
		
		ПодключитьОбработчикОжидания("ВыполнитьОбработчикДлительнойОперации", 0.1, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбработчикиСобытийПерехода(Знач ЭтоПереходДалее)
	
	// Обработчики событий переходов.
	Если ЭтоПереходДалее Тогда
		
		СтрокиПерехода = ТаблицаПереходов.НайтиСтроки(Новый Структура("ПорядковыйНомерПерехода", ПорядковыйНомерПерехода - 1));
		
		Если СтрокиПерехода.Количество() > 0 Тогда
			
			СтрокаПерехода = СтрокиПерехода[0];
			
			// Обработчик ПриПереходеДалее.
			Если Не ПустаяСтрока(СтрокаПерехода.ИмяОбработчикаПриПереходеДалее)
				И Не СтрокаПерехода.ДлительнаяОперация Тогда
				
				ИмяПроцедуры = "Подключаемый_[ИмяОбработчика](Отказ)";
				ИмяПроцедуры = СтрЗаменить(ИмяПроцедуры, "[ИмяОбработчика]", СтрокаПерехода.ИмяОбработчикаПриПереходеДалее);
				
				Отказ = Ложь;
				
				Результат = Вычислить(ИмяПроцедуры);
				
				Если Отказ Тогда
					
					ПорядковыйНомерПерехода = ПорядковыйНомерПерехода - 1;
					Возврат;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		СтрокиПерехода = ТаблицаПереходов.НайтиСтроки(Новый Структура("ПорядковыйНомерПерехода", ПорядковыйНомерПерехода + 1));
		
		Если СтрокиПерехода.Количество() > 0 Тогда
			
			СтрокаПерехода = СтрокиПерехода[0];
			
			// Обработчик ПриПереходеНазад.
			Если Не ПустаяСтрока(СтрокаПерехода.ИмяОбработчикаПриПереходеНазад)
				И Не СтрокаПерехода.ДлительнаяОперация Тогда
				
				ИмяПроцедуры = "Подключаемый_[ИмяОбработчика](Отказ)";
				ИмяПроцедуры = СтрЗаменить(ИмяПроцедуры, "[ИмяОбработчика]", СтрокаПерехода.ИмяОбработчикаПриПереходеНазад);
				
				Отказ = Ложь;
				
				Результат = Вычислить(ИмяПроцедуры);
				
				Если Отказ Тогда
					
					ПорядковыйНомерПерехода = ПорядковыйНомерПерехода + 1;
					Возврат;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	СтрокиПереходаТекущие = ТаблицаПереходов.НайтиСтроки(Новый Структура("ПорядковыйНомерПерехода", ПорядковыйНомерПерехода));
	
	Если СтрокиПереходаТекущие.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Не определена страница для отображения.'");
	КонецЕсли;
	
	СтрокаПереходаТекущая = СтрокиПереходаТекущие[0];
	
	Если СтрокаПереходаТекущая.ДлительнаяОперация И Не ЭтоПереходДалее Тогда
		
		УстановитьПорядковыйНомерПерехода(ПорядковыйНомерПерехода - 1);
		Возврат;
	КонецЕсли;
	
	// обработчик ПриОткрытии
	Если Не ПустаяСтрока(СтрокаПереходаТекущая.ИмяОбработчикаПриОткрытии) Тогда
		
		ИмяПроцедуры = "Подключаемый_[ИмяОбработчика](Отказ, ПропуститьСтраницу, ЭтоПереходДалее)";
		ИмяПроцедуры = СтрЗаменить(ИмяПроцедуры, "[ИмяОбработчика]", СтрокаПереходаТекущая.ИмяОбработчикаПриОткрытии);
		
		Отказ = Ложь;
		ПропуститьСтраницу = Ложь;
		
		Результат = Вычислить(ИмяПроцедуры);
		
		Если Отказ Тогда
			
			ПорядковыйНомерПерехода = ПорядковыйНомерПерехода - 1;
			Возврат;
			
		ИначеЕсли ПропуститьСтраницу Тогда
			
			Если ЭтоПереходДалее Тогда
				
				УстановитьПорядковыйНомерПерехода(ПорядковыйНомерПерехода + 1);
				Возврат;
				
			Иначе
				
				УстановитьПорядковыйНомерПерехода(ПорядковыйНомерПерехода - 1);
				Возврат;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбработчикДлительнойОперации()
	
	СтрокиПереходаТекущие = ТаблицаПереходов.НайтиСтроки(Новый Структура("ПорядковыйНомерПерехода", ПорядковыйНомерПерехода));
	
	Если СтрокиПереходаТекущие.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Не определена страница для отображения.'");
	КонецЕсли;
	
	СтрокаПереходаТекущая = СтрокиПереходаТекущие[0];
	
	// Обработчик ОбработкаДлительнойОперации.
	Если Не ПустаяСтрока(СтрокаПереходаТекущая.ИмяОбработчикаДлительнойОперации) Тогда
		
		ИмяПроцедуры = "Подключаемый_[ИмяОбработчика](Отказ, ПерейтиДалее)";
		ИмяПроцедуры = СтрЗаменить(ИмяПроцедуры, "[ИмяОбработчика]", СтрокаПереходаТекущая.ИмяОбработчикаДлительнойОперации);
		
		Отказ = Ложь;
		ПерейтиДалее = Истина;
		
		Результат = Вычислить(ИмяПроцедуры);
		
		Если Отказ Тогда
			
			ПорядковыйНомерПерехода = ПорядковыйНомерПерехода - 1;
			Возврат;
			
		ИначеЕсли ПерейтиДалее Тогда
			
			УстановитьПорядковыйНомерПерехода(ПорядковыйНомерПерехода + 1);
			Возврат;
			
		КонецЕсли;
		
	Иначе
		
		УстановитьПорядковыйНомерПерехода(ПорядковыйНомерПерехода + 1);
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьКнопкуФормыПоИмениКоманды(ЭлементФормы, ИмяКоманды)
	
	Для Каждого Элемент Из ЭлементФормы.ПодчиненныеЭлементы Цикл
		
		Если ТипЗнч(Элемент) = Тип("ГруппаФормы") Тогда
			
			ЭлементФормыПоИмениКоманды = ПолучитьКнопкуФормыПоИмениКоманды(Элемент, ИмяКоманды);
			
			Если ЭлементФормыПоИмениКоманды <> Неопределено Тогда
				
				Возврат ЭлементФормыПоИмениКоманды;
				
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(Элемент) = Тип("КнопкаФормы")
			И СтрНайти(Элемент.ИмяКоманды, ИмяКоманды) > 0 Тогда
			
			Возврат Элемент;
			
		Иначе
			
			Продолжить;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗавершитьНастройкуНаСервере()
	
	Константы.бит_ум_ВыполнятьНачальнуюНастройкуПрограммы.Установить(Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииПомощника(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ ОткрытаВручную И Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
		
	ЗавершитьНастройкуНаСервере();
	ОбновитьИнтерфейс();

КонецПроцедуры

#Область ОбработчикиСобытийПереходов

&НаКлиенте
Функция Подключаемый_СтраницаОдин_ПриОткрытии(Отказ, ПропуститьСтраницу, Знач ЭтоПереходДалее)
	
	Элементы.ДекорацияОдинОписание.Заголовок = СтроковыеФункцииКлиент.ФорматированнаяСтрока(
		НСтр("ru = 'Для корректного заполнения печатных форм отчетность по иностранным работникам необходимо максимально полно внести информацию о юридическом лице, в котором планируется вести учет иностранных работников в справочнике <b>Организации</b>.
              |Проверьте заполнение полей справочника по ссылке – <a href=""e1cib/list/Справочник.Организации"">Организации</a>.
              |
              |<img src=""бит_ум_СправочникОрганизации"">
              |
              |Для отображения поля «Дополнительные реквизиты» в справочнике Организации в <a href=""e1cib/command/Обработка.ПанельАдминистрированияБСП.Команда.ОбщиеНастройки"">настройках</a> программы должно быть включено отображение дополнительных реквизитов и сведений. Как это сделать описано в руководстве пользователя в разделе «<b>Работа в программе</b>» → «<b>Первоначальные настройки</b>».'"));
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Функция Подключаемый_СтраницаЧетыре_ПриОткрытии(Отказ, ПропуститьСтраницу, Знач ЭтоПереходДалее)
	
	СтраницаЧетыре_ПриОткрытииНаСервере();
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Процедура СтраницаЧетыре_ПриОткрытииНаСервере()
	
	ВидыДокументовИРXML = РеквизитФормыВЗначение("Объект").ПолучитьМакет("ВидыДокументовИР").ПолучитьТекст();
	ВидыДокументовИРТаблица = ОбщегоНазначения.ПрочитатьXMLВТаблицу(ВидыДокументовИРXML).Данные;
	
	ВидыДокументовИРТЗ = ВидыДокументовИР.Выгрузить();
	ВидыДокументовИРТЗ.Очистить();
	
	МассивДокументов = Новый Массив;
	
	Для Каждого Значение Из СтатусыИностранцев Цикл
		
		Если НЕ ЭтаФорма[Значение.Значение] Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураОтбора = Новый Структура("Статус", Значение.Значение);
		
		НайденныеСтроки = ВидыДокументовИРТаблица.НайтиСтроки(СтруктураОтбора);
		
		Для Каждого Строка Из НайденныеСтроки Цикл
			
			Если МассивДокументов.Найти(Строка.Имя) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			МассивДокументов.Добавить(Строка.Имя);
		
			СтрокаТаблицы = ВидыДокументовИРТЗ.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Строка);
			Если СтрокаТаблицы.Предопределенный Тогда
				СтрокаТаблицы.Наименование = Строка(Справочники.бит_ум_ВидыДокументовИР[Строка.Имя]);
			КонецЕсли;
			
			СуществующаяСтрока = ВидыДокументовИР.НайтиСтроки(Новый Структура("Имя", Строка.Имя));
			Если СуществующаяСтрока.Количество() > 0 Тогда
				СтрокаТаблицы.Отметка = СуществующаяСтрока[0].Отметка;
				СтрокаТаблицы.СрокНапоминания = СуществующаяСтрока[0].СрокНапоминания;
			КонецЕсли;
			
		КонецЦикла;	
		
	КонецЦикла;
	
	ВидыДокументовИРТЗ.Сортировать("Наименование");
	ВидыДокументовИР.Загрузить(ВидыДокументовИРТЗ);
	
КонецПроцедуры

&НаКлиенте
Функция Подключаемый_СтраницаОжидания_ОбработкаДлительнойОперации(Отказ, ПерейтиДалее)
	
	ВыполнитьПродолжительноеДействиеНаСервере();
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Процедура ВыполнитьПродолжительноеДействиеНаСервере()
	
	Если ЗначениеЗаполнено(КонтролирующийОрган) Тогда
		СправочникОбъект = Справочники.бит_ум_ГосударственныеОрганы.СоздатьЭлемент();
		СправочникОбъект.Наименование = КонтролирующийОрган;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
		КонтролирующийОрганСсылка = СправочникОбъект.Ссылка;
	Иначе
		КонтролирующийОрганСсылка = Справочники.бит_ум_ГосударственныеОрганы.ПустаяСсылка();
	КонецЕсли;
	
	ВидыДокументовИРXML = РеквизитФормыВЗначение("Объект").ПолучитьМакет("ВидыДокументовИР").ПолучитьТекст();
	ВидыДокументовИРТаблица = ОбщегоНазначения.ПрочитатьXMLВТаблицу(ВидыДокументовИРXML).Данные;
	
	ДействияПоСобытиямXML = РеквизитФормыВЗначение("Объект").ПолучитьМакет("ДействияПоСобытиям").ПолучитьТекст();
	ДействияПоСобытиямТаблица = ОбщегоНазначения.ПрочитатьXMLВТаблицу(ДействияПоСобытиямXML).Данные;
	
	ВидыИРТаблица = ДействияПоСобытиямТаблица.Скопировать();
	ВидыИРТаблица.Свернуть("Статус,СтатусИР,РежимВъездаИР");
	
	ВидыДокументовСоответствие = Новый Соответствие;
	ДействияПоСобытиямСоответствие = Новый Соответствие;
	
	СтруктураОтбора = Новый Структура("Статус");
	
	Для Каждого Значение Из СтатусыИностранцев Цикл
		
		Если НЕ ЭтаФорма[Значение.Значение] Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураОтбора.Статус = Значение.Значение;
		
		ВидыДокументовИРСтроки = ВидыДокументовИРТаблица.НайтиСтроки(СтруктураОтбора);
		ДействияПоСобытиямСтроки = ДействияПоСобытиямТаблица.НайтиСтроки(СтруктураОтбора);
		ВидыИРСтроки = ВидыИРТаблица.НайтиСтроки(СтруктураОтбора);
		
		Для Каждого ВидДокументаИРСтрока Из ВидыДокументовИРСтроки Цикл
			
			ВидДокумента = ВидДокументаИРСтрока.Имя;
			
			СтрокаНастройки = ВидыДокументовИР.НайтиСтроки(Новый Структура("Имя", ВидДокумента));
			Если СтрокаНастройки.Количество() = 0 ИЛИ НЕ СтрокаНастройки[0].Отметка Тогда
				Продолжить;
			КонецЕсли;
			
			Если ВидыДокументовСоответствие.Получить(ВидДокумента) = Неопределено Тогда
				Если ВидДокументаИРСтрока.Предопределенный Тогда
					СправочникОбъект = Справочники.бит_ум_ВидыДокументовИР[ВидДокумента].ПолучитьОбъект();
				Иначе
					СправочникСсылка = Справочники.бит_ум_ВидыДокументовИР.ПолучитьСсылку(
						Новый УникальныйИдентификатор(ВидДокумента));
					Если ОбщегоНазначения.СсылкаСуществует(СправочникСсылка) Тогда
						СправочникОбъект = СправочникСсылка.ПолучитьОбъект();
					Иначе
						СправочникОбъект = Справочники.бит_ум_ВидыДокументовИР.СоздатьЭлемент();
						СправочникОбъект.УстановитьНовыйКод();
						СправочникОбъект.УстановитьСсылкуНового(СправочникСсылка);
						СправочникОбъект.Наименование = ВидДокументаИРСтрока.Наименование;
					КонецЕсли;
				КонецЕсли;
				СправочникОбъект.Обязательный = Истина;
				СправочникОбъект.СрокНапоминания = СтрокаНастройки[0].СрокНапоминания;
				ВидыДокументовСоответствие.Вставить(ВидДокумента, СправочникОбъект);
			КонецЕсли;
			
			СтруктураОтбораВидыИР = Новый Структура("СтатусИР,РежимВъездаИР");
			Для Каждого ВидИрСтрока Из ВидыИРСтроки Цикл
				СтруктураОтбораВидыИР.СтатусИР = Перечисления.бит_ум_СтатусыИР[ВидИрСтрока.СтатусИР];
				СтруктураОтбораВидыИР.РежимВъездаИР = Перечисления.бит_ум_РежимыВъездаИР[ВидИрСтрока.РежимВъездаИР];
				
				Если ВидыДокументовСоответствие.Получить(ВидДокумента).ВидыИР.НайтиСтроки(
					СтруктураОтбораВидыИР).Количество() = 0 Тогда
					ЗаполнитьЗначенияСвойств(ВидыДокументовСоответствие.Получить(ВидДокумента).ВидыИР.Добавить(),
						СтруктураОтбораВидыИР);
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла;
		
		Для Каждого ДействиеПоСобытиюСтрока Из ДействияПоСобытиямСтроки Цикл
			
			Действие = ДействиеПоСобытиюСтрока.Наименование + ДействиеПоСобытиюСтрока.Имя;
			
			Если ДействияПоСобытиямСоответствие.Получить(Действие) = Неопределено Тогда
				СправочникСсылка = Справочники.бит_ум_ДействияПоСобытиям.ПолучитьСсылку(
					Новый УникальныйИдентификатор(ДействиеПоСобытиюСтрока.Ссылка));
				Если ОбщегоНазначения.СсылкаСуществует(СправочникСсылка) Тогда
					СправочникОбъект = СправочникСсылка.ПолучитьОбъект();
				Иначе
					СправочникОбъект = Справочники.бит_ум_ДействияПоСобытиям.СоздатьЭлемент();
					СправочникОбъект.УстановитьНовыйКод();
					СправочникОбъект.УстановитьСсылкуНового(СправочникСсылка);
				КонецЕсли;
				СправочникОбъект.Наименование = ДействиеПоСобытиюСтрока.Наименование;
				СправочникОбъект.ВидОформляемогоДокумента =
					бит_ум_УчетМигрантовПовтИсп.ПолучитьВидОформляемогоДокументаПоИмени(ДействиеПоСобытиюСтрока.Имя);
				СправочникОбъект.КонтролироватьИсполнение = СрокИсполнения <> 0;
				СправочникОбъект.СрокИсполнения = СрокИсполнения;
				СправочникОбъект.КонтролирующийОрган = КонтролирующийОрганСсылка;
				ДействияПоСобытиямСоответствие.Вставить(Действие, СправочникОбъект);
			КонецЕсли;
			
			СтруктураОтбораВидыИР = Новый Структура("СтатусИР,РежимВъездаИР");
			СтруктураОтбораВидыИР.СтатусИР = Перечисления.бит_ум_СтатусыИР[ДействиеПоСобытиюСтрока.СтатусИР];
			СтруктураОтбораВидыИР.РежимВъездаИР = Перечисления.бит_ум_РежимыВъездаИР[ДействиеПоСобытиюСтрока.РежимВъездаИР];
				
			Если ДействияПоСобытиямСоответствие.Получить(Действие).ВидыИР.НайтиСтроки(
				СтруктураОтбораВидыИР).Количество() = 0 Тогда
				ЗаполнитьЗначенияСвойств(ДействияПоСобытиямСоответствие.Получить(Действие).ВидыИР.Добавить(),
					СтруктураОтбораВидыИР);
			КонецЕсли;
				
			СтруктураОтбораСобытия = Новый Структура("Событие");
			СтруктураОтбораСобытия.Событие = Перечисления.бит_ум_ВидыСобытийПоИР[ДействиеПоСобытиюСтрока.Событие];
				
			Если ДействияПоСобытиямСоответствие.Получить(Действие).События.НайтиСтроки(
				СтруктураОтбораСобытия).Количество() = 0 Тогда
				ЗаполнитьЗначенияСвойств(ДействияПоСобытиямСоответствие.Получить(Действие).События.Добавить(),
					СтруктураОтбораСобытия);
			КонецЕсли;			
			
		КонецЦикла;
		
	КонецЦикла;
	
	Для Каждого ВидДокумента Из ВидыДокументовСоответствие Цикл
		ВидДокумента.Значение.Записать();
	КонецЦикла;
	
	Для Каждого Действие Из ДействияПоСобытиямСоответствие Цикл
		Действие.Значение.Записать();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ИнициализацияПереходовПомощника

&НаКлиенте
Процедура ТаблицаПереходовПоСценарию1()
	
	ТаблицаПереходов.Очистить();
	
	Переход = ТаблицаПереходов.Добавить();
	Переход.ПорядковыйНомерПерехода = 1;
	Переход.ИмяОсновнойСтраницы     = "СтраницаОдин";
	Переход.ИмяСтраницыНавигации    = "СтраницаНавигацииНачало";
	Переход.ИмяОбработчикаПриОткрытии = "СтраницаОдин_ПриОткрытии";
	
	Переход = ТаблицаПереходов.Добавить();
	Переход.ПорядковыйНомерПерехода = 2;
	Переход.ИмяОсновнойСтраницы     = "СтраницаДва";
	Переход.ИмяСтраницыНавигации    = "СтраницаНавигацииПродолжение";
	
	Переход = ТаблицаПереходов.Добавить();
	Переход.ПорядковыйНомерПерехода = 3;
	Переход.ИмяОсновнойСтраницы     = "СтраницаТри";
	Переход.ИмяСтраницыНавигации    = "СтраницаНавигацииПродолжение";
	
	Переход = ТаблицаПереходов.Добавить();
	Переход.ПорядковыйНомерПерехода = 4;
	Переход.ИмяОсновнойСтраницы     = "СтраницаЧетыре";
	Переход.ИмяСтраницыНавигации    = "СтраницаНавигацииПродолжение";
	Переход.ИмяОбработчикаПриОткрытии = "СтраницаЧетыре_ПриОткрытии";
	
	Переход = ТаблицаПереходов.Добавить();
	Переход.ПорядковыйНомерПерехода = 5;
	Переход.ИмяОсновнойСтраницы     = "СтраницаОжидания";
	Переход.ИмяСтраницыНавигации    = "СтраницаНавигацииОжидание";
	Переход.ДлительнаяОперация      = Истина;
	Переход.ИмяОбработчикаДлительнойОперации = "СтраницаОжидания_ОбработкаДлительнойОперации";
	
	Переход = ТаблицаПереходов.Добавить();
	Переход.ПорядковыйНомерПерехода = 6;
	Переход.ИмяОсновнойСтраницы     = "СтраницаПять";
	Переход.ИмяСтраницыНавигации    = "СтраницаНавигацииОкончание";
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
